Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS00/include/component/opamp.h
/*
 * Component description for OPAMP
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-01-28T10:04:24Z */
#ifndef _PIC32CMLS00_OPAMP_COMPONENT_H_
#define _PIC32CMLS00_OPAMP_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR OPAMP                                        */
/* ************************************************************************** */

/* -------- OPAMP_CTRLA : (OPAMP Offset: 0x00) (R/W 8) Control A -------- */
#define OPAMP_CTRLA_RESETVALUE                _UINT8_(0x00)                                        /*  (OPAMP_CTRLA) Control A  Reset Value */

#define OPAMP_CTRLA_SWRST_Pos                 _UINT8_(0)                                           /* (OPAMP_CTRLA) Software Reset Position */
#define OPAMP_CTRLA_SWRST_Msk                 (_UINT8_(0x1) << OPAMP_CTRLA_SWRST_Pos)              /* (OPAMP_CTRLA) Software Reset Mask */
#define OPAMP_CTRLA_SWRST(value)              (OPAMP_CTRLA_SWRST_Msk & (_UINT8_(value) << OPAMP_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the OPAMP_CTRLA register */
#define OPAMP_CTRLA_ENABLE_Pos                _UINT8_(1)                                           /* (OPAMP_CTRLA) Enable Position */
#define OPAMP_CTRLA_ENABLE_Msk                (_UINT8_(0x1) << OPAMP_CTRLA_ENABLE_Pos)             /* (OPAMP_CTRLA) Enable Mask */
#define OPAMP_CTRLA_ENABLE(value)             (OPAMP_CTRLA_ENABLE_Msk & (_UINT8_(value) << OPAMP_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the OPAMP_CTRLA register */
#define OPAMP_CTRLA_LPMUX_Pos                 _UINT8_(7)                                           /* (OPAMP_CTRLA) Low-Power Mux Position */
#define OPAMP_CTRLA_LPMUX_Msk                 (_UINT8_(0x1) << OPAMP_CTRLA_LPMUX_Pos)              /* (OPAMP_CTRLA) Low-Power Mux Mask */
#define OPAMP_CTRLA_LPMUX(value)              (OPAMP_CTRLA_LPMUX_Msk & (_UINT8_(value) << OPAMP_CTRLA_LPMUX_Pos)) /* Assigment of value for LPMUX in the OPAMP_CTRLA register */
#define OPAMP_CTRLA_Msk                       _UINT8_(0x83)                                        /* (OPAMP_CTRLA) Register Mask  */


/* -------- OPAMP_STATUS : (OPAMP Offset: 0x02) ( R/ 8) Status -------- */
#define OPAMP_STATUS_RESETVALUE               _UINT8_(0x00)                                        /*  (OPAMP_STATUS) Status  Reset Value */

#define OPAMP_STATUS_READY0_Pos               _UINT8_(0)                                           /* (OPAMP_STATUS) OPAMP 0 Ready Position */
#define OPAMP_STATUS_READY0_Msk               (_UINT8_(0x1) << OPAMP_STATUS_READY0_Pos)            /* (OPAMP_STATUS) OPAMP 0 Ready Mask */
#define OPAMP_STATUS_READY0(value)            (OPAMP_STATUS_READY0_Msk & (_UINT8_(value) << OPAMP_STATUS_READY0_Pos)) /* Assigment of value for READY0 in the OPAMP_STATUS register */
#define OPAMP_STATUS_READY1_Pos               _UINT8_(1)                                           /* (OPAMP_STATUS) OPAMP 1 Ready Position */
#define OPAMP_STATUS_READY1_Msk               (_UINT8_(0x1) << OPAMP_STATUS_READY1_Pos)            /* (OPAMP_STATUS) OPAMP 1 Ready Mask */
#define OPAMP_STATUS_READY1(value)            (OPAMP_STATUS_READY1_Msk & (_UINT8_(value) << OPAMP_STATUS_READY1_Pos)) /* Assigment of value for READY1 in the OPAMP_STATUS register */
#define OPAMP_STATUS_READY2_Pos               _UINT8_(2)                                           /* (OPAMP_STATUS) OPAMP 2 Ready Position */
#define OPAMP_STATUS_READY2_Msk               (_UINT8_(0x1) << OPAMP_STATUS_READY2_Pos)            /* (OPAMP_STATUS) OPAMP 2 Ready Mask */
#define OPAMP_STATUS_READY2(value)            (OPAMP_STATUS_READY2_Msk & (_UINT8_(value) << OPAMP_STATUS_READY2_Pos)) /* Assigment of value for READY2 in the OPAMP_STATUS register */
#define OPAMP_STATUS_Msk                      _UINT8_(0x07)                                        /* (OPAMP_STATUS) Register Mask  */

#define OPAMP_STATUS_READY_Pos                _UINT8_(0)                                           /* (OPAMP_STATUS Position) OPAMP 2 Ready */
#define OPAMP_STATUS_READY_Msk                (_UINT8_(0x7) << OPAMP_STATUS_READY_Pos)             /* (OPAMP_STATUS Mask) READY */
#define OPAMP_STATUS_READY(value)             (OPAMP_STATUS_READY_Msk & (_UINT8_(value) << OPAMP_STATUS_READY_Pos)) 

/* -------- OPAMP_OPAMPCTRL0 : (OPAMP Offset: 0x04) (R/W 32) OPAMP0 Control -------- */
#define OPAMP_OPAMPCTRL0_RESETVALUE           _UINT32_(0x00)                                       /*  (OPAMP_OPAMPCTRL0) OPAMP0 Control  Reset Value */

#define OPAMP_OPAMPCTRL0_ENABLE_Pos           _UINT32_(1)                                          /* (OPAMP_OPAMPCTRL0) Operational Amplifier Enable Position */
#define OPAMP_OPAMPCTRL0_ENABLE_Msk           (_UINT32_(0x1) << OPAMP_OPAMPCTRL0_ENABLE_Pos)       /* (OPAMP_OPAMPCTRL0) Operational Amplifier Enable Mask */
#define OPAMP_OPAMPCTRL0_ENABLE(value)        (OPAMP_OPAMPCTRL0_ENABLE_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_ENABLE_Pos)) /* Assigment of value for ENABLE in the OPAMP_OPAMPCTRL0 register */
#define OPAMP_OPAMPCTRL0_ANAOUT_Pos           _UINT32_(2)                                          /* (OPAMP_OPAMPCTRL0) Analog Output Position */
#define OPAMP_OPAMPCTRL0_ANAOUT_Msk           (_UINT32_(0x1) << OPAMP_OPAMPCTRL0_ANAOUT_Pos)       /* (OPAMP_OPAMPCTRL0) Analog Output Mask */
#define OPAMP_OPAMPCTRL0_ANAOUT(value)        (OPAMP_OPAMPCTRL0_ANAOUT_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_ANAOUT_Pos)) /* Assigment of value for ANAOUT in the OPAMP_OPAMPCTRL0 register */
#define OPAMP_OPAMPCTRL0_BIAS_Pos             _UINT32_(3)                                          /* (OPAMP_OPAMPCTRL0) Bias Selection Position */
#define OPAMP_OPAMPCTRL0_BIAS_Msk             (_UINT32_(0x3) << OPAMP_OPAMPCTRL0_BIAS_Pos)         /* (OPAMP_OPAMPCTRL0) Bias Selection Mask */
#define OPAMP_OPAMPCTRL0_BIAS(value)          (OPAMP_OPAMPCTRL0_BIAS_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_BIAS_Pos)) /* Assigment of value for BIAS in the OPAMP_OPAMPCTRL0 register */
#define   OPAMP_OPAMPCTRL0_BIAS_MODE0_Val     _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL0) Minimum current consumption, but the slowest mode  */
#define   OPAMP_OPAMPCTRL0_BIAS_MODE1_Val     _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL0) Low current consumption, slow speed  */
#define   OPAMP_OPAMPCTRL0_BIAS_MODE2_Val     _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL0) High current consumption, fast speed  */
#define   OPAMP_OPAMPCTRL0_BIAS_MODE3_Val     _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL0) Maximum current consumption, but the fastest mode  */
#define OPAMP_OPAMPCTRL0_BIAS_MODE0           (OPAMP_OPAMPCTRL0_BIAS_MODE0_Val << OPAMP_OPAMPCTRL0_BIAS_Pos) /* (OPAMP_OPAMPCTRL0) Minimum current consumption, but the slowest mode Position  */
#define OPAMP_OPAMPCTRL0_BIAS_MODE1           (OPAMP_OPAMPCTRL0_BIAS_MODE1_Val << OPAMP_OPAMPCTRL0_BIAS_Pos) /* (OPAMP_OPAMPCTRL0) Low current consumption, slow speed Position  */
#define OPAMP_OPAMPCTRL0_BIAS_MODE2           (OPAMP_OPAMPCTRL0_BIAS_MODE2_Val << OPAMP_OPAMPCTRL0_BIAS_Pos) /* (OPAMP_OPAMPCTRL0) High current consumption, fast speed Position  */
#define OPAMP_OPAMPCTRL0_BIAS_MODE3           (OPAMP_OPAMPCTRL0_BIAS_MODE3_Val << OPAMP_OPAMPCTRL0_BIAS_Pos) /* (OPAMP_OPAMPCTRL0) Maximum current consumption, but the fastest mode Position  */
#define OPAMP_OPAMPCTRL0_RES2VCC_Pos          _UINT32_(5)                                          /* (OPAMP_OPAMPCTRL0) Resistor ladder To VCC Position */
#define OPAMP_OPAMPCTRL0_RES2VCC_Msk          (_UINT32_(0x1) << OPAMP_OPAMPCTRL0_RES2VCC_Pos)      /* (OPAMP_OPAMPCTRL0) Resistor ladder To VCC Mask */
#define OPAMP_OPAMPCTRL0_RES2VCC(value)       (OPAMP_OPAMPCTRL0_RES2VCC_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_RES2VCC_Pos)) /* Assigment of value for RES2VCC in the OPAMP_OPAMPCTRL0 register */
#define OPAMP_OPAMPCTRL0_RUNSTDBY_Pos         _UINT32_(6)                                          /* (OPAMP_OPAMPCTRL0) Run in Standby Position */
#define OPAMP_OPAMPCTRL0_RUNSTDBY_Msk         (_UINT32_(0x1) << OPAMP_OPAMPCTRL0_RUNSTDBY_Pos)     /* (OPAMP_OPAMPCTRL0) Run in Standby Mask */
#define OPAMP_OPAMPCTRL0_RUNSTDBY(value)      (OPAMP_OPAMPCTRL0_RUNSTDBY_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the OPAMP_OPAMPCTRL0 register */
#define OPAMP_OPAMPCTRL0_ONDEMAND_Pos         _UINT32_(7)                                          /* (OPAMP_OPAMPCTRL0) On Demand Control Position */
#define OPAMP_OPAMPCTRL0_ONDEMAND_Msk         (_UINT32_(0x1) << OPAMP_OPAMPCTRL0_ONDEMAND_Pos)     /* (OPAMP_OPAMPCTRL0) On Demand Control Mask */
#define OPAMP_OPAMPCTRL0_ONDEMAND(value)      (OPAMP_OPAMPCTRL0_ONDEMAND_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OPAMP_OPAMPCTRL0 register */
#define OPAMP_OPAMPCTRL0_RES2OUT_Pos          _UINT32_(8)                                          /* (OPAMP_OPAMPCTRL0) Resistor ladder To Output Position */
#define OPAMP_OPAMPCTRL0_RES2OUT_Msk          (_UINT32_(0x1) << OPAMP_OPAMPCTRL0_RES2OUT_Pos)      /* (OPAMP_OPAMPCTRL0) Resistor ladder To Output Mask */
#define OPAMP_OPAMPCTRL0_RES2OUT(value)       (OPAMP_OPAMPCTRL0_RES2OUT_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_RES2OUT_Pos)) /* Assigment of value for RES2OUT in the OPAMP_OPAMPCTRL0 register */
#define OPAMP_OPAMPCTRL0_RES1EN_Pos           _UINT32_(9)                                          /* (OPAMP_OPAMPCTRL0) Resistor 1 Enable Position */
#define OPAMP_OPAMPCTRL0_RES1EN_Msk           (_UINT32_(0x1) << OPAMP_OPAMPCTRL0_RES1EN_Pos)       /* (OPAMP_OPAMPCTRL0) Resistor 1 Enable Mask */
#define OPAMP_OPAMPCTRL0_RES1EN(value)        (OPAMP_OPAMPCTRL0_RES1EN_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_RES1EN_Pos)) /* Assigment of value for RES1EN in the OPAMP_OPAMPCTRL0 register */
#define OPAMP_OPAMPCTRL0_RES1MUX_Pos          _UINT32_(10)                                         /* (OPAMP_OPAMPCTRL0) Resistor 1 Mux Position */
#define OPAMP_OPAMPCTRL0_RES1MUX_Msk          (_UINT32_(0x7) << OPAMP_OPAMPCTRL0_RES1MUX_Pos)      /* (OPAMP_OPAMPCTRL0) Resistor 1 Mux Mask */
#define OPAMP_OPAMPCTRL0_RES1MUX(value)       (OPAMP_OPAMPCTRL0_RES1MUX_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_RES1MUX_Pos)) /* Assigment of value for RES1MUX in the OPAMP_OPAMPCTRL0 register */
#define   OPAMP_OPAMPCTRL0_RES1MUX_OA0POS_Val _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL0) OPAMP0 Positive Input  */
#define   OPAMP_OPAMPCTRL0_RES1MUX_OA0NEG_Val _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL0) OPAMP0 Negative Input  */
#define   OPAMP_OPAMPCTRL0_RES1MUX_DAC_REFBUF_Val _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL0) DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)  */
#define   OPAMP_OPAMPCTRL0_RES1MUX_AVSS_Val   _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL0) Ground  */
#define   OPAMP_OPAMPCTRL0_RES1MUX_RG_CONN_Val _UINT32_(0x4)                                        /* (OPAMP_OPAMPCTRL0) RG_CONN  */
#define OPAMP_OPAMPCTRL0_RES1MUX_OA0POS       (OPAMP_OPAMPCTRL0_RES1MUX_OA0POS_Val << OPAMP_OPAMPCTRL0_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL0) OPAMP0 Positive Input Position  */
#define OPAMP_OPAMPCTRL0_RES1MUX_OA0NEG       (OPAMP_OPAMPCTRL0_RES1MUX_OA0NEG_Val << OPAMP_OPAMPCTRL0_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL0) OPAMP0 Negative Input Position  */
#define OPAMP_OPAMPCTRL0_RES1MUX_DAC_REFBUF   (OPAMP_OPAMPCTRL0_RES1MUX_DAC_REFBUF_Val << OPAMP_OPAMPCTRL0_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL0) DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF) Position  */
#define OPAMP_OPAMPCTRL0_RES1MUX_AVSS         (OPAMP_OPAMPCTRL0_RES1MUX_AVSS_Val << OPAMP_OPAMPCTRL0_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL0) Ground Position  */
#define OPAMP_OPAMPCTRL0_RES1MUX_RG_CONN      (OPAMP_OPAMPCTRL0_RES1MUX_RG_CONN_Val << OPAMP_OPAMPCTRL0_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL0) RG_CONN Position  */
#define OPAMP_OPAMPCTRL0_POTMUX_Pos           _UINT32_(13)                                         /* (OPAMP_OPAMPCTRL0) Potentiometer Selection Position */
#define OPAMP_OPAMPCTRL0_POTMUX_Msk           (_UINT32_(0x7) << OPAMP_OPAMPCTRL0_POTMUX_Pos)       /* (OPAMP_OPAMPCTRL0) Potentiometer Selection Mask */
#define OPAMP_OPAMPCTRL0_POTMUX(value)        (OPAMP_OPAMPCTRL0_POTMUX_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_POTMUX_Pos)) /* Assigment of value for POTMUX in the OPAMP_OPAMPCTRL0 register */
#define   OPAMP_OPAMPCTRL0_POTMUX_14R_2R_Val  _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL0) R1 = 14R, R2 = 2R  */
#define   OPAMP_OPAMPCTRL0_POTMUX_12R_4R_Val  _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL0) R1 = 12R, R2 = 4R  */
#define   OPAMP_OPAMPCTRL0_POTMUX_8R_8R_Val   _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL0) R1 = 8R, R2 = 8R  */
#define   OPAMP_OPAMPCTRL0_POTMUX_6R_10R_Val  _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL0) R1 = 6R, R2 = 10R  */
#define   OPAMP_OPAMPCTRL0_POTMUX_4R_12R_Val  _UINT32_(0x4)                                        /* (OPAMP_OPAMPCTRL0) R1 = 4R, R2 = 12R  */
#define   OPAMP_OPAMPCTRL0_POTMUX_3R_13R_Val  _UINT32_(0x5)                                        /* (OPAMP_OPAMPCTRL0) R1 = 3R, R2 = 13R  */
#define   OPAMP_OPAMPCTRL0_POTMUX_2R_14R_Val  _UINT32_(0x6)                                        /* (OPAMP_OPAMPCTRL0) R1 = 2R, R2 = 14R  */
#define   OPAMP_OPAMPCTRL0_POTMUX_R_15R_Val   _UINT32_(0x7)                                        /* (OPAMP_OPAMPCTRL0) R1 = 1R, R2 = 15R  */
#define OPAMP_OPAMPCTRL0_POTMUX_14R_2R        (OPAMP_OPAMPCTRL0_POTMUX_14R_2R_Val << OPAMP_OPAMPCTRL0_POTMUX_Pos) /* (OPAMP_OPAMPCTRL0) R1 = 14R, R2 = 2R Position  */
#define OPAMP_OPAMPCTRL0_POTMUX_12R_4R        (OPAMP_OPAMPCTRL0_POTMUX_12R_4R_Val << OPAMP_OPAMPCTRL0_POTMUX_Pos) /* (OPAMP_OPAMPCTRL0) R1 = 12R, R2 = 4R Position  */
#define OPAMP_OPAMPCTRL0_POTMUX_8R_8R         (OPAMP_OPAMPCTRL0_POTMUX_8R_8R_Val << OPAMP_OPAMPCTRL0_POTMUX_Pos) /* (OPAMP_OPAMPCTRL0) R1 = 8R, R2 = 8R Position  */
#define OPAMP_OPAMPCTRL0_POTMUX_6R_10R        (OPAMP_OPAMPCTRL0_POTMUX_6R_10R_Val << OPAMP_OPAMPCTRL0_POTMUX_Pos) /* (OPAMP_OPAMPCTRL0) R1 = 6R, R2 = 10R Position  */
#define OPAMP_OPAMPCTRL0_POTMUX_4R_12R        (OPAMP_OPAMPCTRL0_POTMUX_4R_12R_Val << OPAMP_OPAMPCTRL0_POTMUX_Pos) /* (OPAMP_OPAMPCTRL0) R1 = 4R, R2 = 12R Position  */
#define OPAMP_OPAMPCTRL0_POTMUX_3R_13R        (OPAMP_OPAMPCTRL0_POTMUX_3R_13R_Val << OPAMP_OPAMPCTRL0_POTMUX_Pos) /* (OPAMP_OPAMPCTRL0) R1 = 3R, R2 = 13R Position  */
#define OPAMP_OPAMPCTRL0_POTMUX_2R_14R        (OPAMP_OPAMPCTRL0_POTMUX_2R_14R_Val << OPAMP_OPAMPCTRL0_POTMUX_Pos) /* (OPAMP_OPAMPCTRL0) R1 = 2R, R2 = 14R Position  */
#define OPAMP_OPAMPCTRL0_POTMUX_R_15R         (OPAMP_OPAMPCTRL0_POTMUX_R_15R_Val << OPAMP_OPAMPCTRL0_POTMUX_Pos) /* (OPAMP_OPAMPCTRL0) R1 = 1R, R2 = 15R Position  */
#define OPAMP_OPAMPCTRL0_MUXPOS_Pos           _UINT32_(16)                                         /* (OPAMP_OPAMPCTRL0) Positive Input Mux Selection Position */
#define OPAMP_OPAMPCTRL0_MUXPOS_Msk           (_UINT32_(0xF) << OPAMP_OPAMPCTRL0_MUXPOS_Pos)       /* (OPAMP_OPAMPCTRL0) Positive Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL0_MUXPOS(value)        (OPAMP_OPAMPCTRL0_MUXPOS_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_MUXPOS_Pos)) /* Assigment of value for MUXPOS in the OPAMP_OPAMPCTRL0 register */
#define   OPAMP_OPAMPCTRL0_MUXPOS_OA0POS_Val  _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL0) OPAMP0 Positive Input  */
#define   OPAMP_OPAMPCTRL0_MUXPOS_OA0TAP_Val  _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL0) OPAMP0 Resistor ladder taps  */
#define   OPAMP_OPAMPCTRL0_MUXPOS_DAC_REFBUF_Val _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL0) REFERENCE or DAC VOUT0 Output  */
#define   OPAMP_OPAMPCTRL0_MUXPOS_AVSS_Val    _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL0) Ground  */
#define OPAMP_OPAMPCTRL0_MUXPOS_OA0POS        (OPAMP_OPAMPCTRL0_MUXPOS_OA0POS_Val << OPAMP_OPAMPCTRL0_MUXPOS_Pos) /* (OPAMP_OPAMPCTRL0) OPAMP0 Positive Input Position  */
#define OPAMP_OPAMPCTRL0_MUXPOS_OA0TAP        (OPAMP_OPAMPCTRL0_MUXPOS_OA0TAP_Val << OPAMP_OPAMPCTRL0_MUXPOS_Pos) /* (OPAMP_OPAMPCTRL0) OPAMP0 Resistor ladder taps Position  */
#define OPAMP_OPAMPCTRL0_MUXPOS_DAC_REFBUF    (OPAMP_OPAMPCTRL0_MUXPOS_DAC_REFBUF_Val << OPAMP_OPAMPCTRL0_MUXPOS_Pos) /* (OPAMP_OPAMPCTRL0) REFERENCE or DAC VOUT0 Output Position  */
#define OPAMP_OPAMPCTRL0_MUXPOS_AVSS          (OPAMP_OPAMPCTRL0_MUXPOS_AVSS_Val << OPAMP_OPAMPCTRL0_MUXPOS_Pos) /* (OPAMP_OPAMPCTRL0) Ground Position  */
#define OPAMP_OPAMPCTRL0_MUXNEG_Pos           _UINT32_(20)                                         /* (OPAMP_OPAMPCTRL0) Negative Input Mux Selection Position */
#define OPAMP_OPAMPCTRL0_MUXNEG_Msk           (_UINT32_(0xF) << OPAMP_OPAMPCTRL0_MUXNEG_Pos)       /* (OPAMP_OPAMPCTRL0) Negative Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL0_MUXNEG(value)        (OPAMP_OPAMPCTRL0_MUXNEG_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL0_MUXNEG_Pos)) /* Assigment of value for MUXNEG in the OPAMP_OPAMPCTRL0 register */
#define   OPAMP_OPAMPCTRL0_MUXNEG_OA0NEG_Val  _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL0) OPAMP0 Negative Input  */
#define   OPAMP_OPAMPCTRL0_MUXNEG_OA0TAP_Val  _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL0) OPAMP0 Resistor ladder taps  */
#define   OPAMP_OPAMPCTRL0_MUXNEG_DAC_REFBUF_Val _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL0) DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)  */
#define   OPAMP_OPAMPCTRL0_MUXNEG_OA0OUT_Val  _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL0) OPAMP0 Output  */
#define OPAMP_OPAMPCTRL0_MUXNEG_OA0NEG        (OPAMP_OPAMPCTRL0_MUXNEG_OA0NEG_Val << OPAMP_OPAMPCTRL0_MUXNEG_Pos) /* (OPAMP_OPAMPCTRL0) OPAMP0 Negative Input Position  */
#define OPAMP_OPAMPCTRL0_MUXNEG_OA0TAP        (OPAMP_OPAMPCTRL0_MUXNEG_OA0TAP_Val << OPAMP_OPAMPCTRL0_MUXNEG_Pos) /* (OPAMP_OPAMPCTRL0) OPAMP0 Resistor ladder taps Position  */
#define OPAMP_OPAMPCTRL0_MUXNEG_DAC_REFBUF    (OPAMP_OPAMPCTRL0_MUXNEG_DAC_REFBUF_Val << OPAMP_OPAMPCTRL0_MUXNEG_Pos) /* (OPAMP_OPAMPCTRL0) DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF) Position  */
#define OPAMP_OPAMPCTRL0_MUXNEG_OA0OUT        (OPAMP_OPAMPCTRL0_MUXNEG_OA0OUT_Val << OPAMP_OPAMPCTRL0_MUXNEG_Pos) /* (OPAMP_OPAMPCTRL0) OPAMP0 Output Position  */
#define OPAMP_OPAMPCTRL0_Msk                  _UINT32_(0x00FFFFFE)                                 /* (OPAMP_OPAMPCTRL0) Register Mask  */


